[Killed] ConditionalExpression
server/crypto.ts:4:24
 import crypto from "crypto";
 
 // Use JWT_SECRET as the base for encryption key
-const ENCRYPTION_KEY = process.env.JWT_SECRET || "default-key-change-in-production";
+const ENCRYPTION_KEY = false;
 
 const ALGORITHM = "aes-256-gcm";
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: The "password" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, or DataView. Received type boolean (false)

[Killed] ConditionalExpression
server/crypto.ts:4:24
 import crypto from "crypto";
 
 // Use JWT_SECRET as the base for encryption key
-const ENCRYPTION_KEY = process.env.JWT_SECRET || "default-key-change-in-production";
+const ENCRYPTION_KEY = true;
 
 const ALGORITHM = "aes-256-gcm";
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: The "password" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, or DataView. Received type boolean (true)

[Killed] StringLiteral
server/crypto.ts:6:19
 // Use JWT_SECRET as the base for encryption key
 const ENCRYPTION_KEY = process.env.JWT_SECRET || "default-key-change-in-production";
 
-const ALGORITHM = "aes-256-gcm";
+const ALGORITHM = "";
 const SALT_LENGTH = 16; // Random salt per encryption
 const IV_LENGTH = 16;
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unknown cipher

[Killed] BlockStatement
server/crypto.ts:15:42
  * Derive a 32-byte key from the secret using a random salt
  * SECURITY: Using per-encryption random salt prevents rainbow table attacks
  */
-function deriveKey(salt: Buffer): Buffer {
-  return crypto.scryptSync(ENCRYPTION_KEY, salt, 32);
-}
+function deriveKey(salt: Buffer): Buffer {}
 
 /**
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: The "key" argument must be of type string or an instance of ArrayBuffer, Buffer, TypedArray, DataView, KeyObject, or CryptoKey. Received undefined

[Killed] BlockStatement
server/crypto.ts:23:47
  * Encrypt a string (API key) using AES-256-GCM with per-encryption random salt
  * Format: salt (16 bytes) + iv (16 bytes) + authTag (16 bytes) + encrypted data
  */
-export function encrypt(text: string): string {
-  // Generate random salt for each encryption
-  const salt = crypto.randomBytes(SALT_LENGTH);
-  const key = deriveKey(salt);
-  const iv = crypto.randomBytes(IV_LENGTH);
-  const cipher = crypto.createCipheriv(ALGORITHM, key, iv);
-  
-  let encrypted = cipher.update(text, "utf8", "hex");
-  encrypted += cipher.final("hex");
-  
-  const authTag = cipher.getAuthTag();
-  
-  // Combine salt + IV + authTag + encrypted data
-  return salt.toString("hex") + iv.toString("hex") + authTag.toString("hex") + encrypted;
-}
+export function encrypt(text: string): string {}
 
 /**
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Cannot read properties of undefined (reading 'slice')

[Killed] AssignmentOperator
server/crypto.ts:31:3
   const cipher = crypto.createCipheriv(ALGORITHM, key, iv);
   
   let encrypted = cipher.update(text, "utf8", "hex");
-  encrypted += cipher.final("hex");
+  encrypted -= cipher.final("hex");
   
   const authTag = cipher.getAuthTag();
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: The argument 'encoding' is invalid for data of length 3. Received 'hex'

[Killed] ArithmeticOperator
server/crypto.ts:36:10
   const authTag = cipher.getAuthTag();
   
   // Combine salt + IV + authTag + encrypted data
-  return salt.toString("hex") + iv.toString("hex") + authTag.toString("hex") + encrypted;
+  return salt.toString("hex") - iv.toString("hex") + authTag.toString("hex") + encrypted;
 }
 
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Invalid authentication tag length: 6

[Killed] ArithmeticOperator
server/crypto.ts:36:10
   const authTag = cipher.getAuthTag();
   
   // Combine salt + IV + authTag + encrypted data
-  return salt.toString("hex") + iv.toString("hex") + authTag.toString("hex") + encrypted;
+  return salt.toString("hex") + iv.toString("hex") - authTag.toString("hex") + encrypted;
 }
 
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Invalid authentication tag length: 0

[Killed] BlockStatement
server/crypto.ts:43:56
  * Decrypt an encrypted string back to the original API key
  * Extracts the salt used during encryption to derive the same key
  */
-export function decrypt(encryptedText: string): string {
-  // Extract salt, IV, authTag, and encrypted data
-  const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH * 2), "hex");
-  const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
-  const authTag = Buffer.from(
-    encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
-    "hex"
-  );
-  const encrypted = encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2);
-  
-  // Derive the same key using the stored salt
-  const key = deriveKey(salt);
-  
-  const decipher = crypto.createDecipheriv(ALGORITHM, key, iv);
-  decipher.setAuthTag(authTag);
-  
-  let decrypted = decipher.update(encrypted, "hex", "utf8");
-  decrypted += decipher.final("utf8");
-  
-  return decrypted;
-}
+export function decrypt(encryptedText: string): string {}
 
 /**
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: expected undefined to be 'sk-test-api-key-12345' // Object.is equality

[Killed] MethodExpression
server/crypto.ts:45:28
  */
 export function decrypt(encryptedText: string): string {
   // Extract salt, IV, authTag, and encrypted data
-  const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH * 2), "hex");
+  const salt = Buffer.from(encryptedText, "hex");
   const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
   const authTag = Buffer.from(
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unsupported state or unable to authenticate data

[Killed] ArithmeticOperator
server/crypto.ts:45:51
  */
 export function decrypt(encryptedText: string): string {
   // Extract salt, IV, authTag, and encrypted data
-  const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH * 2), "hex");
+  const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH / 2), "hex");
   const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
   const authTag = Buffer.from(
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unsupported state or unable to authenticate data

[Killed] MethodExpression
server/crypto.ts:46:26
 export function decrypt(encryptedText: string): string {
   // Extract salt, IV, authTag, and encrypted data
   const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH * 2), "hex");
-  const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
+  const iv = Buffer.from(encryptedText, "hex");
   const authTag = Buffer.from(
     encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unsupported state or unable to authenticate data

[Killed] ArithmeticOperator
server/crypto.ts:46:63
 export function decrypt(encryptedText: string): string {
   // Extract salt, IV, authTag, and encrypted data
   const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH * 2), "hex");
-  const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
+  const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH / 2 + IV_LENGTH * 2), "hex");
   const authTag = Buffer.from(
     encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unsupported state or unable to authenticate data

[Killed] ArithmeticOperator
server/crypto.ts:48:92
   const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH * 2), "hex");
   const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
   const authTag = Buffer.from(
-    encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
+    encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH / 2), 
     "hex"
   );
killedBy: Crypto Module encrypt/decrypt should fail decryption with wrong authTag boundary
statusReason: expected [Function] to throw an error

[Killed] ArithmeticOperator
server/crypto.ts:48:43
   const salt = Buffer.from(encryptedText.slice(0, SALT_LENGTH * 2), "hex");
   const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
   const authTag = Buffer.from(
-    encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
+    encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH / 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
     "hex"
   );
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Invalid authentication tag length: 28

[Killed] StringLiteral
server/crypto.ts:49:5
   const iv = Buffer.from(encryptedText.slice(SALT_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2), "hex");
   const authTag = Buffer.from(
     encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
-    "hex"
+    ""
   );
   const encrypted = encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2);
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Invalid authentication tag length: 32

[Killed] ArithmeticOperator
server/crypto.ts:51:41
     encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
     "hex"
   );
-  const encrypted = encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2);
+  const encrypted = encryptedText.slice(SALT_LENGTH * 2 - IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2);
   
   // Derive the same key using the stored salt
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unsupported state or unable to authenticate data

[Killed] MethodExpression
server/crypto.ts:51:21
     encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2, SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2), 
     "hex"
   );
-  const encrypted = encryptedText.slice(SALT_LENGTH * 2 + IV_LENGTH * 2 + AUTH_TAG_LENGTH * 2);
+  const encrypted = encryptedText;
   
   // Derive the same key using the stored salt
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unsupported state or unable to authenticate data

[Killed] StringLiteral
server/crypto.ts:59:46
   const decipher = crypto.createDecipheriv(ALGORITHM, key, iv);
   decipher.setAuthTag(authTag);
   
-  let decrypted = decipher.update(encrypted, "hex", "utf8");
+  let decrypted = decipher.update(encrypted, "", "utf8");
   decrypted += decipher.final("utf8");
   
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: Unsupported state or unable to authenticate data

[Killed] AssignmentOperator
server/crypto.ts:60:3
   decipher.setAuthTag(authTag);
   
   let decrypted = decipher.update(encrypted, "hex", "utf8");
-  decrypted += decipher.final("utf8");
+  decrypted -= decipher.final("utf8");
   
   return decrypted;
killedBy: Crypto Module encrypt/decrypt should encrypt and decrypt a string correctly
statusReason: expected NaN to be 'sk-test-api-key-12345' // Object.is equality

[Survived] StringLiteral
server/crypto.ts:60:31
   decipher.setAuthTag(authTag);
   
   let decrypted = decipher.update(encrypted, "hex", "utf8");
-  decrypted += decipher.final("utf8");
+  decrypted += decipher.final("");
   
   return decrypted;

[Killed] BlockStatement
server/crypto.ts:68:52
 /**
  * Get the last 4 characters of an API key for display hint
  */
-export function getKeyHint(apiKey: string): string {
-  if (apiKey.length < 4) return "****";
-  return apiKey.slice(-4);
-}
+export function getKeyHint(apiKey: string): string {}
 
 /**
killedBy: Crypto Module getKeyHint should return last 4 characters of API key
statusReason: expected undefined to be '2345' // Object.is equality

[Killed] ConditionalExpression
server/crypto.ts:69:7
  * Get the last 4 characters of an API key for display hint
  */
 export function getKeyHint(apiKey: string): string {
-  if (apiKey.length < 4) return "****";
+  if (false) return "****";
   return apiKey.slice(-4);
 }
killedBy: Crypto Module getKeyHint should return **** for keys shorter than 4 characters
statusReason: expected 'abc' to be '****' // Object.is equality

[Killed] EqualityOperator
server/crypto.ts:69:7
  * Get the last 4 characters of an API key for display hint
  */
 export function getKeyHint(apiKey: string): string {
-  if (apiKey.length < 4) return "****";
+  if (apiKey.length >= 4) return "****";
   return apiKey.slice(-4);
 }
killedBy: Crypto Module getKeyHint should return last 4 characters of API key
statusReason: expected '****' to be '2345' // Object.is equality

[Killed] MethodExpression
server/crypto.ts:70:10
  */
 export function getKeyHint(apiKey: string): string {
   if (apiKey.length < 4) return "****";
-  return apiKey.slice(-4);
+  return apiKey;
 }
 
killedBy: Crypto Module getKeyHint should return last 4 characters of API key
statusReason: expected 'sk-test-api-key-12345' to be '2345' // Object.is equality

[Killed] UnaryOperator
server/crypto.ts:70:23
  */
 export function getKeyHint(apiKey: string): string {
   if (apiKey.length < 4) return "****";
-  return apiKey.slice(-4);
+  return apiKey.slice(+4);
 }
 
killedBy: Crypto Module getKeyHint should return last 4 characters of API key
statusReason: expected 'est-api-key-12345' to be '2345' // Object.is equality

[Killed] BlockStatement
server/crypto.ts:76:52
 /**
  * Mask an API key for display (show first 4 and last 4 chars)
  */
-export function maskApiKey(apiKey: string): string {
-  if (apiKey.length <= 8) return "****";
-  return apiKey.slice(0, 4) + "..." + apiKey.slice(-4);
-}
+export function maskApiKey(apiKey: string): string {}
 
killedBy: Crypto Module maskApiKey should mask middle of API key
statusReason: expected undefined to be 'sk-t...2345' // Object.is equality

[Killed] EqualityOperator
server/crypto.ts:77:7
  * Mask an API key for display (show first 4 and last 4 chars)
  */
 export function maskApiKey(apiKey: string): string {
-  if (apiKey.length <= 8) return "****";
+  if (apiKey.length > 8) return "****";
   return apiKey.slice(0, 4) + "..." + apiKey.slice(-4);
 }
killedBy: Crypto Module maskApiKey should mask middle of API key
statusReason: expected '****' to be 'sk-t...2345' // Object.is equality

[Killed] EqualityOperator
server/crypto.ts:77:7
  * Mask an API key for display (show first 4 and last 4 chars)
  */
 export function maskApiKey(apiKey: string): string {
-  if (apiKey.length <= 8) return "****";
+  if (apiKey.length < 8) return "****";
   return apiKey.slice(0, 4) + "..." + apiKey.slice(-4);
 }
killedBy: Crypto Module maskApiKey should return **** for keys 8 characters or shorter
statusReason: expected '1234...5678' to be '****' // Object.is equality

[Killed] MethodExpression
server/crypto.ts:78:10
  */
 export function maskApiKey(apiKey: string): string {
   if (apiKey.length <= 8) return "****";
-  return apiKey.slice(0, 4) + "..." + apiKey.slice(-4);
+  return apiKey + "..." + apiKey.slice(-4);
 }
 
killedBy: Crypto Module maskApiKey should mask middle of API key
statusReason: expected 'sk-test-api-key-12345...2345' to be 'sk-t...2345' // Object.is equality

[Killed] MethodExpression
server/crypto.ts:78:39
  */
 export function maskApiKey(apiKey: string): string {
   if (apiKey.length <= 8) return "****";
-  return apiKey.slice(0, 4) + "..." + apiKey.slice(-4);
+  return apiKey.slice(0, 4) + "..." + apiKey;
 }
 
killedBy: Crypto Module maskApiKey should mask middle of API key
statusReason: expected 'sk-t...sk-test-api-key-12345' to be 'sk-t...2345' // Object.is equality
